Repository: NaN-tic/trytond-import_csv
Catalog: locale/*.po
Languages: ca_es, es, es_es

# help:import.csv,email:
source: Send email after import data
es: Envia correo después de importar datos

# help:import.csv,header:
source: Set this check box if CSV file has a header.
es: Marque este campo si el fichero CSV contiene cabezera

# help:import.csv,match_expression:
source: Eval Python expression to skip some CSV lines, it will exclude all rows matching this criteria. Example: row[5] == "Cancelled" and row[11] == "user@domain.com"
es: Evalua la expresión Python para omitir lineas del CSV. Ejemplo: row[5] == "Cancelled" and row[11] == "user@domain.com"

# help:import.csv,quote:
source: Character to use as a quote of strings.
es: El carácter que se usa como delimitador.

# help:import.csv,separator:
source: Field separator in CSV lines.
es: Campo separador en el fichero CSV.

# help:import.csv,thousands_separator:
source: Thousand separator used when there is a number.
es: Separador de miles cuando es un número.

# help:import.csv.column,add_to_domain:
source: If checked, adds this field to domain for searching records in order to avoid duplicates.
es: Si está seleccionado, añade este campo en el dominio para buscar registros para evitar duplicados.

# help:import.csv.column,column:
source: The position of the CSV columns separated by commas to get the content of this field. First one is 0.
es: La posición de las columnas CSV separadas por comas para obtener este valor. Empieza por 0.

# help:import.csv.column,constant:
source: A constant value to set in this field.
es: Un valor constante para este campo.

# help:import.csv.column,date_format:
source: Set the CSV format of the DateTime, Date or Timestamp data. %d: Day. %H: Hours. %m: Month. %M: Minutes. %Y: Year. %S: Seconds. Use commas to separate more than one field. Eg: %d/%m/%Y,%H:%M:%S Will match date and time from two fields like '13/01/2015' and '17:01:56' To see more information visit: https://docs.python.org/2/library/datetime.html?highlight=datetime#strftime-and-strptime-behavior
es: Usa el formato CSV para Fecha Hora o Hora.

# help:import.csv.column,selection:
source: A couple of key and value separated by ":" per line
es: Una clave y valor separados por ":"

# help:import.csv.file,skip_repeated:
source: If any record of the CSV file is already imported, skip it.
ca_es: Si algun registre del fitxer CSV ja s'ha importat, l'omet.
es: Si algún registro del archivo CSV ya se ha importado, lo omite.

# help:import.csv.file,update_record:
source: If any record of the CSV file is found with the search domain, update the record.
ca_es: Si algun registre del fitxer CSV es troba amb la cerca del domini, l'actualitzarà.
es: Si algún registro del archivo CSV se encuentra en la búsqueda del dominio, lo actualizará.

# model:import.csv,name:
source: Import CSV
es: Importación CSV

# model:import.csv.column,name:
source: Import CSV Column
es: Importar columna CSV

# model:import.csv.file,name:
source: Import CSV File
ca_es: Importar fitxer CSV
es: Importar archivo CSV

# model:ir.action,name:
source: Import CSV Profiles
es: Perfiles de importación CSV

# model:ir.action,name:act_import_csv
source: Import CSV Profiles
es: Perfiles de importación CSV

# model:ir.action,name:act_import_csv_file
source: Import CSV Files
ca_es: Importa fitxers CSV
es: Importar archivos CSV

# model:ir.ui.menu,name:
source: Import CSV Profiles
es: Perfiles de importación CSV

# model:ir.ui.menu,name:menu_import_csv_file
source: CSV Files
es: Importar archivos CSV

# model:ir.ui.menu,name:menu_import_import_csvs
source: CSV Profiles
es: Perfil CSV

# selection:import.csv,decimal_separator:
source: Comma (,)
es: Coma (,)

# selection:import.csv,decimal_separator:
source: Dot (.)
es: Punto (.)

# selection:import.csv,separator:
source: Comma
es: Coma

# selection:import.csv,separator:
source: Semicolon
es: Punto y coma

# selection:import.csv,separator:
source: Tabulator
es: Tabulador

# selection:import.csv,thousands_separator:
source: Comma (,)
es: Coma (,)

# selection:import.csv,thousands_separator:
source: Dot (.)
es: Punto (.)

# selection:import.csv,thousands_separator:
source: Others
es: Otros

# selection:import.csv.file,state:
source: Done
ca_es: Realitzat
es: Realizado

# selection:import.csv.file,state:
source: Draft
ca_es: Esborrany
es: Borrador

# view:import.csv.column:
source: CSV Columns Profiles
es: Perfil columna CSV

# view:import.csv.column:
source: Profile CSV Column
es: Columna perfil CSV

# view:import.csv.file:
source: Import CSV File
ca_es: Importar fitxer CSV
es: Importar archivo CSV

# view:import.csv.file:
source: Time
es: Hora

# view:import.csv:
source: CSV Profiles
es: Perfil CSV

# view:import.csv:
source: Profile CSV
es: Perfil CSV

# error:import.csv.file:
source: Database general failure. Error raised: %s.
ca_es: Error general de la base de dades. Error: %s.

# error:import.csv.file:
source: Error in Match Expression Domain. Error raised: %s
ca_es: Error en el domini de la expressió. L'error és: %s

# error:import.csv.file:
source: Field %s is required but not value found in record %s. Record skipped!
ca_es: El camp %s és requerit però no s'ha trobat cap valor al registre %s. Registre omès!

# error:import.csv.file:
source: Functional field %s has not setter method.
ca_es: El camp funcional %s no té mètode setter.

# error:import.csv.file:
source: Please, check that the CSV file is effectively a CSV file.
ca_es: Si us plau, comproveu que el fitxer CSV és efectivament un fitxer CSV.

# error:import.csv.file:
source: Row %s skipped by "Exclude Rows" filter rule.
ca_es: Fila %s omesa per la regla del filtre "Excloure files".

# error:import.csv.file:
source: This kind of domain is not implemented yet.
ca_es: Aquest tipus de domini no està implementat encara.

# error:import.csv.file:
source: You cannot import a CSV record because "%s" have lines.
ca_es: No podeu importar un registre CSV perquè "%s" té línies.

# error:import.csv.file:
source: You cannot import a CSV record because "%s" is not draft state.
ca_es: No podeu importar un registre CSV perquè "%s" no està en estat esborrany.

# error:profile.csv.column:
source: The "Columns" and "Constant" fields of line %s can not be empty at the same time. Please fill at least one of them.
ca_es: Els camps "Columnes" i "Constants" de la línia %s no poden estar buits alhora. Si us plau ompliu un d'ells.

# field:import.csv.file,profile_csv:
source: CSV Profile
ca_es: Perfil CSV

# field:import.csv.file,update_record:
source: Update Records
ca_es: Actualitza registres

# field:profile.csv,character_encoding:
source: CSV Character Encoding
ca_es: Codificació de caràcters CSV

# field:profile.csv,decimal_separator:
source: CSV Decimal Separator
ca_es: Separador decimal CSV

# field:profile.csv,header:
source: CSV Header
ca_es: Capçalera CSV

# field:profile.csv,match_expression:
source: Exclude Rows
ca_es: Excloure files

# field:profile.csv,quote:
source: CSV Quote
ca_es: Delimitador CSV

# field:profile.csv,thousands_separator:
source: CSV Thousand Separator
ca_es: Separador de milers CSV

# field:profile.csv.column,column:
source: Columns
ca_es: Columnes

# field:profile.csv.column,profile_csv:
source: CSV Profile
ca_es: Perfil CSV

# help:profile.csv,decimal_separator:
source: Decimal separator used when there is a number.
ca_es: El separador de decimals utilitzat si hi ha un número.

# help:profile.csv,header:
source: Set this check box if CSV file has a header.
ca_es: Marqueu aquesta casella si el fitxer CSV té una capçalera.

# help:profile.csv,match_expression:
source: Eval Python expression to skip some CSV lines, it will exclude all rows matching this criteria. Example: row[5] == "Cancelled" and row[11] == "user@domain.com"
ca_es: Expressió eval de Python per ometre algunes línies CSV, exclourà totes les files coincidents amb aquest criteri. Exemple: row[5] == "Cancelled" and row[11] == "user@domain.com"

# help:profile.csv,quote:
source: Character to use as a quote of strings.
ca_es: Caràcter utilitzat com delimitador de textos.

# help:profile.csv,separator:
source: Field separator in CSV lines.
ca_es: Separador de camp en les línies del fitxer CSV.

# help:profile.csv,thousands_separator:
source: Thousand separator used when there is a number.
ca_es: El separador de milers utilitzat si hi ha un número.

# help:profile.csv.column,add_to_domain:
source: If checked, adds this field to domain for searching records in order to avoid duplicates.
ca_es: Si està marcat, afegeix aquest domini al camp per cercar registres amb la finalitat d'evitar duplicats.

# help:profile.csv.column,column:
source: The position of the CSV columns separated by commas to get the content of this field. First one is 0.
ca_es: La posició de les columnes CSV separades per comes per obtenir el contingut d'aquest camp. La primera columna és 0.

# help:profile.csv.column,date_format:
source: Set the CSV format of the DateTime, Date or Timestamp data. %d: Day. %H: Hours. %m: Month. %M: Minutes. %Y: Year. %S: Seconds. Use commas to separate more than one field. Eg: %d/%m/%Y,%H:%M:%S Will match date and time from two fields like '13/01/2015' and '17:01:56' To see more information visit: https://docs.python.org/2/library/datetime.html?highlight=datetime#strftime-and-strptime-behavior
ca_es: Establiu el format CSV de la dada de DataHora, Data o Hora. %d: Dia. %H: Hores. %m: Mes. %M: Minuts. %Y: Any. %S: Segons. Utilitzeu comes per separar més d'un camp. Exemple: %d/%m/%Y,%H:%M:%S Coincidirà data i hora de dos camps com '13/01/2015' i '17:01:56' Per veure més informació visiteu: https://docs.python.org/2/library/datetime.html?highlight=datetime#strftime-and-strptime-behavior

# help:profile.csv.column,search_record_code:
source: Type the Python code for mapping this field. You can use: * self: To make reference to this mapping record. * pool: To make reference to the data base objects. * values: List of values. There is one for each column selected on field "Columns". Useful when you want concatenate strings of various columns in one field, or when you want use more than one value as a criteria to search in many2one or *2many fields. You must assign the result to a variable called "result".
ca_es: Escriviu el codi Python per assignar aquest camp. Podeu utilitzar: * self: Per fer referència a aquest registre d'assignació. * pool: Per fer referència als objectes de la base de dades. * values: Llista de valors. Hi ha un per cada columna seleccionada al camp "Columnes". Útil quan voleu concatener cadenes de caràcters de vàries columnes en un camp, o quan voleu usar més d'un valor com a criteri de cerca de camps many2one o *2many. Heu d'assignar el resultat a una variable anomenada "result".

# model:ir.ui.menu,name:menu_import_csv_file
source: Import CSV Files
ca_es: Importa fitxers CSV
