Repository: NaN-tic/trytond-import_csv
Catalog: locale/*.po
Languages: ca_es, es, es_es

# error:import.csv:
source: Database general failure. Error raised: %s.
es_es: Error general en la base de datos. Error: %s.

# error:import.csv:
source: Error in Match Expression Domain. Error raised: %s
es_es: Error en el dominio de la expresión. El error es: %s

# error:import.csv:
source: Field %s is required but not value found in record %s. Record skipped!
es_es: El campo %s es obligatorio pero no se ha encontrado un valor en el registro %s. ¡Registro omitido!

# error:import.csv:
source: Please, check that the CSV file configuration matches with the format of the CSV file.
es_es: Por favor, compruebe que la configuración del archivo CSV concuerda con el formato del archivo CSV.

# error:import.csv:
source: Please, check that the CSV file is effectively a CSV file.
es_es: Por favor, compruebe que el archivo CSV es efectivamente un archivo CSV.

# error:import.csv:
source: Record %s skipped. Already exists.
es_es: Registro %s omitido. Ya existe.

# error:import.csv:
source: Row %s skipped by "Exclude Row" filter rule.
es_es: Fila %s omitida por la regla de filtro "Expresión de coincidencia".

# error:import.csv:
source: This kind of domain is not implemented yet.
es_es: Este tipo de dominio no está implementado todavía.

# error:import.csv:
source: You cannot import a CSV record because "%s" have lines.
es_es: No puede importar un registro CSV porque "%s" tiene líneas.

# error:import.csv:
source: You cannot import a CSV record because "%s" is not draft state.
es_es: No puede importar un registro CSV porque "%s" no está en estado borrador.

# error:profile.csv.column:
source: Columns on field '%s' must be integers separated by commas.
ca_es: Les columnes del camp '%s' han ser enters separats per comes.
es_es: Las columnas del campo '%s' deben ser enteros separados por comas.

# error:profile.csv.column:
source: Error importing Char. Possible causes: - The character encoding of the file is wrong. Field: '%s'
ca_es: Error important cadena de caràcters. Possible causa: - La codificació del fitxer és errònia. Camp: '%s'
es_es: Error importando cadena caracteres. Posible causa: - La codificación del fichero es errónea. Campo: '%s'

# error:profile.csv.column:
source: Error importing DateTime, Date or Time. Possible causes: - The format of the date is wrong. - The csv file has a header and you does not checked the box on the wizard. Field: '%s' Value: '%s' Format: '%s'
ca_es: Error important DataHora, Data o Hora. Possible causa: - El format de la data és erroni. Camp: '%s' Valor: '%s' Format: '%s'
es_es: Error importando FechaHora, Fecha u Hora. Posible causa: - El formato de la fecha es erróneo. Campo: '%s' Valor: '%s' Formato: '%s'

# error:profile.csv.column:
source: Error importing boolean. Possible causes: - The format of the boolean is wrong. - The csv file has a header and you does not checked the box on the wizard. Field: '%s' Value: '%s'
ca_es: Error important booleà. Possible causa: - El format del booleà és erroni. Camp: '%s' Valor: '%s'
es_es: Error importando booleano. Posible causa: - El formato del booleano es erróneo. Campo: '%s' Valor: '%s'

# error:profile.csv.column:
source: Error importing integer. Field '%s' has a very big number: Value: '%s' Value must be between -2147483648 and 2147483647
ca_es: Error important enter. Camp: '%s' té un número molt gran: Valor: '%s' El valor ha d'estar entre -2147483648 i 2147483647
es_es: Error importando entero. Campo: '%s' tiene un número muy grande: Valor: '%s' El valor debe estar entre -2147483648 y 2147483647

# error:profile.csv.column:
source: Error importing integer. Possible causes: - The format of the number is wrong. - The csv file has a header and you does not checked the box on the wizard. Field: '%s' Value: '%s'
ca_es: Error important enter. Possible causa: - El format del número és erroni. Camp: '%s' Valor: '%s'
es_es: Error importando intero. Posible causa: - El formato del número es erróneo. Campo: '%s' Valor: '%s'

# error:profile.csv.column:
source: Error importing numeric. Possible causes: - The format of the number is wrong. - The csv file has a header and you does not checked the box on the wizard. Field: '%s' Value: '%s'
ca_es: Error important número. Possible causa: - El format del número és erroni. Camp: '%s' Valor: '%s'
es_es: Error importando número. Posible causa: - El formato del número es erróneo. Campo: '%s' Valor: '%s'

# error:profile.csv.column:
source: The "Columns" and "Constant" fields of line %s can not be empty at a time. Please fill at least one of them.
es_es: Los campos "Columnas" y "Constante" de la línea %s no pueden estar vacíos al mismo tiempo. Por favor rellene uno de ellos.

# field:import.csv.log,children:
source: Log Lines
es_es: Líneas de registro

# field:import.csv.log,comment:
source: Comment
es_es: Comentario

# field:import.csv.log,create_date:
source: Create Date
es_es: Fecha creación

# field:import.csv.log,create_uid:
source: Create User
es_es: Usuario creación

# field:import.csv.log,date_time:
source: Date and Time
es_es: Fecha y hora

# field:import.csv.log,origin:
source: Origin
es_es: Origen

# field:import.csv.log,parent:
source: Parent
es_es: Padre

# field:import.csv.log,rec_name:
source: Name
es_es: Nombre

# field:import.csv.log,status:
source: Status
es_es: Estado

# field:import.csv.log,write_date:
source: Write Date
es_es: Fecha modificación

# field:import.csv.log,write_uid:
source: Write User
es_es: Usuario modificación

# field:import.csv.start,attachment:
source: Attachment
es_es: Adjunto

# field:import.csv.start,character_encoding:
source: Character Encoding
es_es: Codificación de caracteres

# field:import.csv.start,header:
source: Headers
es_es: Cabeceras

# field:import.csv.start,import_file:
source: Import File
es_es: Importar archivo

# field:import.csv.start,skip_repeated:
source: Skip Repeated
es_es: Omitir repetidos

# field:import.csv.start,update_record:
source: Update Record
es_es: Actualizar registro

# field:profile.csv,active:
source: Active
ca_es: Actiu
es_es: Activo

# field:profile.csv,character_encoding:
source: Character Encoding
es_es: Codificación de caracteres

# field:profile.csv,columns:
source: Columns
ca_es: Columnes
es_es: Columnas

# field:profile.csv,create_date:
source: Create Date
ca_es: Data creació
es_es: Fecha creación

# field:profile.csv,create_uid:
source: Create User
ca_es: Usuari creació
es_es: Usuario creación

# field:profile.csv,decimal_separator:
source: Decimal Separator
es_es: Separador decimal

# field:profile.csv,header:
source: Header
es_es: Cabecera

# field:profile.csv,match_expression:
source: Match Expression
es_es: Expresión de coincidencia

# field:profile.csv,model:
source: Model
es_es: Modelo

# field:profile.csv,name:
source: Name
ca_es: Nom
es_es: Nombre

# field:profile.csv,quote:
source: Quote
es_es: Delimitador

# field:profile.csv,rec_name:
source: Name
ca_es: Nom
es_es: Nombre

# field:profile.csv,separator:
source: CSV Separator
ca_es: Separador CSV
es_es: Separador CSV

# field:profile.csv,thousands_separator:
source: Thousands Separator
es_es: Separador de millar

# field:profile.csv,write_date:
source: Write Date
ca_es: Data modificació
es_es: Fecha modificación

# field:profile.csv,write_uid:
source: Write User
ca_es: Usuari modificació
es_es: Usuario modificación

# field:profile.csv.column,add_to_domain:
source: Add to Search Domain
ca_es: Afegeix al domini de cerca
es_es: Añadir al dominio de búsqueda

# field:profile.csv.column,column:
source: Column
es_es: Columna

# field:profile.csv.column,constant:
source: Constant
es_es: Constante

# field:profile.csv.column,create_date:
source: Create Date
ca_es: Data creació
es_es: Fecha creación

# field:profile.csv.column,create_uid:
source: Create User
ca_es: Usuari creació
es_es: Usuario creación

# field:profile.csv.column,date_format:
source: Date Format
ca_es: Format de data
es_es: Formato de fecha

# field:profile.csv.column,field:
source: Field
ca_es: Camp
es_es: Campo

# field:profile.csv.column,profile_csv:
source: Profile CSV
es_es: Perfil CSV

# field:profile.csv.column,rec_name:
source: Name
ca_es: Nom
es_es: Nombre

# field:profile.csv.column,search_record_code:
source: Search Record Code
ca_es: Codi de cerca de registre
es_es: Código de búsqueda de registro

# field:profile.csv.column,selection:
source: Selection
ca_es: Selecció
es_es: Selección

# field:profile.csv.column,ttype:
source: Field Type
ca_es: Tipus de camp
es_es: Tipo de campo

# field:profile.csv.column,write_date:
source: Write Date
ca_es: Data modificació
es_es: Fecha modificación

# field:profile.csv.column,write_uid:
source: Write User
ca_es: Usuari modificació
es_es: Usuario modificación

# help:import.csv.start,attachment:
source: Attach CSV file after import.
es_es: Adjunta archivo CSV tras la importación.

# help:import.csv.start,header:
source: Set this check box to true if CSV file has headers.
es_es: Marque esta casilla si el archivo CSV tiene cabeceras.

# help:import.csv.start,skip_repeated:
source: If any record of the CSV file is already imported, skip it.
es_es: Si algún registro del fichero CSV ya se ha importado, omítelo.

# help:import.csv.start,update_record:
source: If any record of the CSV file is already found with search domain, update records.
es_es: Si hay registros del CSV que se encuentren en la búsqueda del dominio, se actualizarán.

# help:profile.csv,decimal_separator:
source: If there are a number the decimal separator used
es_es: Si hay un número el separador de decimales utilizado.

# help:profile.csv,header:
source: Header (field names) on archives
es_es: Cabecera (nombres de campo) en los archivos.

# help:profile.csv,match_expression:
source: Eval Python expresion to skip some CSV lines. Example: row[5] == "Cancelled" and row[11] == "user@domain.com" Will exclude all rows matching this criteria.
es_es: Expresión eval de Python para omitir algunas líneas CSV. Ejemplo: row[5] == "Cancelled" and row[11] == "user@domain.com"

# help:profile.csv,quote:
source: Character to use as quote
es_es: Carácter utilizado como delimitador

# help:profile.csv,separator:
source: Archive CSV Separator
es_es: Separador de archivo CSV

# help:profile.csv,thousands_separator:
source: If there are a number the thousands separator used
es_es: Si hay un número el separador de millar utilizado.

# help:profile.csv.column,add_to_domain:
source: If checked, adds this field to domain for searching records in order to avoid duplications.
es_es: Si está marcado, añade este campo al dominio para buscar registros con la finalidad de evitar duplicados.

# help:profile.csv.column,column:
source: The position of the columns separated by commas corresponding to this field.
es_es: La posición de las columnas separadas por comas correspondiente a este campo.

# help:profile.csv.column,constant:
source: A constant value to set in this field.
ca_es: Un valor constant per omplenar aquest camp.
es_es: Un valor constante para establecer este campo.

# help:profile.csv.column,date_format:
source: Set the csv format of the DateTime, Date or Timestamp data. %d: Day. %H: Hours. %m: Month. %M: Minutes. %Y: Year. %S: Seconds. Use commas to separate more than one field. Eg: %d/%m/%Y,%H:%M:%S Will match date and time from two fields like '13/01/2015' and '17:01:56' To see more information visit: https://docs.python.org/2/library/datetime.html?highlight=datetime#strftime-and-strptime-behavior
es_es: Establezca el formato del dato csv de la FechaHora, Fecha u Hora. %d: Día. %H: Horas. %m: Mes. %M: Minutos. %Y: Año. %S: Segundos. Utilice comas para separar más de un campo. Ejemplo: %d/%m/%Y,%H:%M:%S Coincidirá fecha y hora de dos campos como '13/01/2015' y '17:01:56' Para ver más información visite: https://docs.python.org/2/library/datetime.html?highlight=datetime#strftime-and-strptime-behavior

# help:profile.csv.column,search_record_code:
source: Type the python code for mapping this field. You can use: * self: To make reference to this mapping record. * pool: To make reference to the data base objects. * values: List of values. There is one for each column selected on field "Columns". Useful when you want concatenate strings of various columns in one field, or when you want use more than one value as a criteria to search in many2one or *2many fields. You must assign the result to a variable called "result".
es_es: Escriba el código Python para asignar este campo. Puede usar: * self: Para hacer referencia a este registro de asignación. * pool: Para hacer referencia al objeto de la base de datos. * value: Lista de valores. Hay uno por cada columna seleccionada en el campo "Columnas". Útil cuando desea concatenar cadenas de carácteres de varias columnas un campo, o cuando quiere usar más de un valor como criterio de búsqueda de campos many2one o *2many. Debe asignar el resultado a una variable denominada "result".

# help:profile.csv.column,selection:
source: A couple of key and value separated by ":" per line
ca_es: Un parell clau valor separats per ":" en cada línia.
es_es: Un par clave valor separado por ":" por línea

# model:import.csv.log,name:
source: Import CSV Log
es_es: Logs de importación CSV

# model:import.csv.start,name:
source: Import CSV start
es_es: Inicio de importación CSV

# model:ir.action,name:act_import_csv
source: Import CSV
es_es: Importar CSV

# model:ir.action,name:act_import_csv_logs
source: Import CSV Logs
es_es: Logs importación CSV

# model:ir.action,name:act_imported_csv_logs
source: Import CSV Logs
es_es: Logs importación CSV

# model:ir.action,name:act_profile_csv
source: Import CSV Profiles
ca_es: Perfils d'importació CSV
es_es: Perfiles de importación CSV

# model:ir.action.act_window.domain,name:act_import_csv_logs_all
source: Alls
es_es: Todos

# model:ir.action.act_window.domain,name:act_import_csv_logs_roots
source: Parents
es_es: Padres

# model:ir.ui.menu,name:main_menu_import_csv
source: Import CSV
ca_es: Importa CSV
es: Importación CSV
es_es: Importación CSV

# model:ir.ui.menu,name:menu_import_csv
source: Import CSV
es_es: Importar CSV

# model:ir.ui.menu,name:menu_import_profile_csvs
source: Import CSV Profiles
ca_es: Perfils d'importació CSV
es_es: Perfiles de importación CSV

# model:profile.csv,name:
source: Profile CSV
ca_es: Perfil CSV
es_es: Perfil CSV

# model:profile.csv.column,name:
source: Profile CSV Column
ca_es: Columna de perfil CSV
es_es: Columna de perfil CSV

# model:res.group,name:group_import_csv_user
source: Import CSV User
ca_es: Usuari d'importació CSV
es: Usuario importación CSV
es_es: Usuario de importación CSV

# selection:import.csv.log,status:
source: Done
es_es: Realizado

# selection:import.csv.log,status:
source: Skipped
es_es: Omitida

# selection:import.csv.start,character_encoding:
source: Latin-1
es_es: Latín-1

# selection:profile.csv,character_encoding:
source: Latin-1
ca_es: Latín-1
es_es: Latín-1

# selection:profile.csv,decimal_separator:
source: Comma (,)
ca_es: Coma (,)
es_es: Coma (,)

# selection:profile.csv,decimal_separator:
source: Dot (.)
ca_es: Punt (.)
es_es: Punto (.)

# selection:profile.csv,separator:
source: Comma
ca_es: Coma
es_es: Coma

# selection:profile.csv,separator:
source: Semicolon
ca_es: Punt i coma
es_es: Punto y coma

# selection:profile.csv,separator:
source: Tabulator
ca_es: Tabulador
es_es: Tabulador

# selection:profile.csv,thousands_separator:
source: Comma (,)
ca_es: Coma (,)
es_es: Coma (,)

# selection:profile.csv,thousands_separator:
source: Dot (.)
ca_es: Punt (.)
es_es: Punto (.)

# selection:profile.csv,thousands_separator:
source: Others
ca_es: Altres
es_es: Otros

# view:import.csv.log:
source: Import CSV Logs
es_es: Logs de importación CSV

# view:import.csv.log:
source: Time
es_es: Hora

# view:import.csv.start:
source: Import CSV File
es_es: Importar archivo CSV

# view:profile.csv.column:
source: CSV Columns Profiles
ca_es: Perfils de columna CSV
es_es: Perfiles de columna CSV

# view:profile.csv.column:
source: Profile CSV Column
ca_es: Columna de perfil CSV
es_es: Columna de perfil CSV

# view:profile.csv:
source: CSV Profiles
ca_es: Perfils CSV
es_es: Perfiles CSV

# view:profile.csv:
source: Profile CSV
ca_es: Perfil CSV
es_es: Perfil CSV

# wizard_button:import.csv,start,end:
source: Cancel
es_es: Cancelar

# wizard_button:import.csv,start,import_file:
source: Import File
es_es: Importar archivo

# error:import.csv.column:
source: Columns on field '%s' must be integers separated by commas.
es: Campo del a columna "%s" debe ser un entero separado por comas.

# error:import.csv.column:
source: Error importing Char. Possible causes: - The character encoding of the file is wrong. Field: '%s'
es: Error importando un carácter. Posibles causas: - El formato del carácter no es correcta - El fichero CSV tiene cabeceres y no se ha marcado esta opción. Campo: '%s'

# error:import.csv.column:
source: Error importing DateTime, Date or Time. Possible causes: - The format of the date is wrong. - The csv file has a header and you does not checked the box on the wizard. Field: '%s' Value: '%s' Format: '%s'
es: Error importando Fecha Hora, Fecha o Hora. Posibles causas: - El formato de la fecha no es correcta - El fichero CSV tiene cabeceres y no se ha marcado esta opción. Campo: '%s' Valor: '%s' Formato: '%s

# error:import.csv.column:
source: Error importing boolean. Possible causes: - The format of the boolean is wrong. - The csv file has a header and you does not checked the box on the wizard. Field: '%s' Value: '%s'
es: Error importando un boleano. Posibles causas: - El formato del boleano no es correcta - El fichero CSV tiene cabeceres y no se ha marcado esta opción. Campo: '%s' Valor: '%s'

# error:import.csv.column:
source: Error importing integer. Field '%s' has a very big number: Value: '%s' Value must be between -2147483648 and 2147483647
es: Error importando un entero. El campo '%s' es un número grande Valor: '%s' El valor debe ser entre -2147483648 y 2147483647

# error:import.csv.column:
source: Error importing integer. Possible causes: - The format of the number is wrong. - The csv file has a header and you does not checked the box on the wizard. Field: '%s' Value: '%s'
es: Error importando un entero. Posibles causas: - El formato del entero no es correcta - El fichero CSV tiene cabeceres y no se ha marcado esta opción. Campo: '%s' Valor: '%s'

# error:import.csv.column:
source: Error importing numeric. Possible causes: - The format of the number is wrong. - The csv file has a header and you does not checked the box on the wizard. Field: '%s' Value: '%s'
es: Error importando un número. Posibles causas: - El formato del número no es correcta - El fichero CSV tiene cabeceres y no se ha marcado esta opción. Campo: '%s' Valor: '%s'

# error:import.csv.column:
source: The "Columns" and "Constant" fields of line %s can not be empty at the ame time. Please fill at least one of them.
es: Los campos columnas y constante de la linea %s no debe estar vacío.

# error:import.csv.file:
source: %s has not any email address
ca_es: %s no té cap adreça de correu electrònic.
es: % no tiene dirección de correo electrónico.

# error:import.csv.file:
source: CSV Import result
ca_es: Resultat de la importació CSV
es: Resultado de la importación CSV

# error:import.csv.file:
source: Please, check that the CSV file configuration matches with the format of the CSV file.
ca_es: Si us plau, comproveu que la configuració del fitxer CSV coincideix amb el format del fitxer CSV.
es: Por favor, compruebe que la configuración del archivo CSV concuerda con el formato del archivo CSV.

# error:import.csv.file:
source: Record %s added.
ca_es: Registre %s afegit.
es: Registro %s añadido.

# error:import.csv.file:
source: Record %s skipped. Already exists.
ca_es: Registre %s omès. Ja existeix.
es: Registro %s omitido. Ya existe.

# error:import.csv.file:
source: Record %s updated.
ca_es: Registre %s actualitzat.
es: Registro %s actualizado.

# error:import.csv.file:
source: Successfully imported %s records.
es: Se han importado %s registros.

# error:import.csv.file:
source: Unsuccessfully imported %s records.Check configuration profile or CSV file
es: No se han importado %s registros. Revise la configuración del perfil o del fichero CSV.

# field:import.csv,active:
source: Active
es: Activo

# field:import.csv,character_encoding:
source: CSV Character Encoding
es: Codificación carácter CSV

# field:import.csv,columns:
source: Columns
es: Columnas

# field:import.csv,create_date:
source: Create Date
es: Fecha de creación

# field:import.csv,create_uid:
source: Create User
es: Usuario de creación

# field:import.csv,decimal_separator:
source: CSV Decimal Separator
es: Separador decimal CSV

# field:import.csv,header:
source: CSV Header
es: Cabezera CSV

# field:import.csv,match_expression:
source: Exclude Rows
es: Excluir filas

# field:import.csv,method:
source: Method
es: Método

# field:import.csv,model:
source: Model
es: Mdoelo

# field:import.csv,name:
source: Name
es: Nombre

# field:import.csv,quote:
source: CSV Quote
es: Delimitador CSV

# field:import.csv,rec_name:
source: Name
es: Nombre

# field:import.csv,separator:
source: CSV Separator
es: Separador CSV

# field:import.csv,thousands_separator:
source: CSV Thousand Separator
es: Separador de miles CSV

# field:import.csv,write_date:
source: Write Date
es: Fecha de modificación

# field:import.csv,write_uid:
source: Write User
es: Usuario de modificación

# field:import.csv.column,add_to_domain:
source: Add to Domain
es: Añade un dominio

# field:import.csv.column,column:
source: Columns
es: Columnas

# field:import.csv.column,constant:
source: Constant
es: Constante

# field:import.csv.column,create_date:
source: Create Date
es: Fecha de creación

# field:import.csv.column,create_uid:
source: Create User
es: Usuario de creación

# field:import.csv.column,date_format:
source: Date Format
es: Formato fecha

# field:import.csv.column,field:
source: Field
es: Campo

# field:import.csv.column,field_type:
source: Field Type
es: Tipo fichero

# field:import.csv.column,profile_csv:
source: Import CSV
es: Importación CSV

# field:import.csv.column,rec_name:
source: Name
es: Nombre

# field:import.csv.column,selection:
source: Selection
es: Selección

# field:import.csv.column,subfield:
source: Subfield
es: Subcampo

# field:import.csv.column,submodel:
source: Submodel
es: Submodelo

# field:import.csv.column,ttype:
source: Field Type
es: Tipo fichero

# field:import.csv.column,write_date:
source: Write Date
es: Fecha de modificación

# field:import.csv.column,write_uid:
source: Write User
es: Usuario de modificación

# field:import.csv.file,create_date:
source: Create Date
ca_es: Data creació
es: Fecha de creación

# field:import.csv.file,create_uid:
source: Create User
ca_es: Usuari creació
es: Usuario de creación

# field:import.csv.file,csv_file:
source: CSV File to import
ca_es: Fitxer CSV a importar
es: Archivo CSV a importar

# field:import.csv.file,date_:
source: Date
es: Fecha

# field:import.csv.file,file_name:
source: File Name
es: Nombre fichero

# field:import.csv.file,profile_csv:
source: Profile CSV
es: Perfil CSV

# field:import.csv.file,rec_name:
source: Name
ca_es: Nom
es: Nombre

# field:import.csv.file,skip_repeated:
source: Skip Repeated
ca_es: Omet repetits
es: Omitir repetido

# field:import.csv.file,state:
source: State
ca_es: Estat
es: Estado

# field:import.csv.file,update_record:
source: Update Record
es: Actualizar registros

# field:import.csv.file,write_date:
source: Write Date
ca_es: Data modificació
es: Fecha de modificación

# field:import.csv.file,write_uid:
source: Write User
ca_es: Usuari modificació
es: Usuario de modificación

# help:import.csv,decimal_separator:
source: Decimal separator used when there is a number.
es: Separador decimal cuando es un número.
